{
  "architectures": [
    "InklingForConditionalGeneration"
  ],
  "audio_bos_token_id": 200020,
  "audio_config": {
    "audio_mode": "dmel",
    "bias": false,
    "dmel_max_value": 2.0,
    "dmel_min_value": -7.0,
    "initializer_range": 0.02,
    "mel_vocab_size": 4,
    "model_type": "inkling_audio",
    "n_mel_bins": 4,
    "rms_norm_eps": 1e-06,
    "text_hidden_size": 128,
    "use_audio_norm": true
  },
  "audio_token_id": 200053,
  "dtype": "float32",
  "image_bos_token_id": 200005,
  "image_token_id": 200054,
  "model_type": "inkling_mm_model",
  "text_config": {
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "chain_hidden_post_norm": false,
    "conv_kernel_size": 4,
    "d_rel": 16,
    "eos_token_id": 2,
    "final_logit_softcapping": null,
    "gate_activation": "sigmoid",
    "head_dim": 16,
    "hidden_act": "silu",
    "hidden_size": 128,
    "initializer_range": 0.02,
    "intermediate_size": 256,
    "layer_types": [
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid"
    ],
    "local_layer_ids": [
      0,
      1,
      2,
      3,
      4
    ],
    "log_scaling_alpha": 0.1,
    "log_scaling_n_floor": 128000,
    "logits_mup_width_multiplier": 24.0,
    "max_position_embeddings": 131072,
    "mlp_layer_types": [
      "dense",
      "dense",
      "sparse",
      "sparse",
      "sparse",
      "sparse"
    ],
    "model_type": "inkling_text",
    "moe_intermediate_size": 64,
    "mtp_hidden_states_first": true,
    "mtp_local_layer_ids": null,
    "n_routed_experts": 8,
    "n_shared_experts": 2,
    "norm_after_topk": true,
    "num_attention_heads": 4,
    "num_experts_per_tok": 2,
    "num_hidden_layers": 6,
    "num_key_value_heads": 2,
    "num_mtp_layers": null,
    "number_of_conv_states": 4,
    "o_bias": false,
    "pad_token_id": null,
    "q_bias": false,
    "rel_extent": 16,
    "rms_norm_eps": 1e-06,
    "rms_norm_eps_moe_gate": 1e-06,
    "route_scale": 8.0,
    "shared_expert_sink": true,
    "sliding_window_size": 8,
    "swa_head_dim": 16,
    "swa_num_attention_heads": 4,
    "swa_num_key_value_heads": 2,
    "unpadded_vocab_size": 480,
    "use_embed_norm": true,
    "use_gate_bias": true,
    "use_global_scale": true,
    "use_sconv": true,
    "vocab_size": 512
  },
  "transformers_version": "5.14.1",
  "vision_config": {
    "hidden_size": 8,
    "initializer_range": 0.02,
    "model_type": "inkling_vision",
    "n_channels": 3,
    "n_layers": 1,
    "num_attention_heads": 1,
    "num_channels": 3,
    "patch_size": 2,
    "rms_norm_eps": 1e-06,
    "temporal_patch_size": 2,
    "text_hidden_size": 128,
    "use_vision_norm": true,
    "vision_encoder_type": "hmlp"
  }
}
