{
  "architectures": [
    "InklingForConditionalGeneration"
  ],
  "dtype": "float32",
  "model_type": "inkling_mm_model",
  "text_config": {
    "attention_dropout": 0.0,
    "bos_token_id": 200006,
    "chain_hidden_post_norm": false,
    "conv_kernel_size": 4,
    "d_rel": 16,
    "eos_token_id": 200006,
    "final_logit_softcapping": null,
    "gate_activation": "sigmoid",
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 6144,
    "initializer_range": 0.02,
    "intermediate_size": 24576,
    "layer_types": [
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid_sliding",
      "hybrid"
    ],
    "local_layer_ids": [
      0,
      1,
      2,
      3,
      4,
      6,
      7,
      8,
      9,
      10,
      12,
      13,
      14,
      15,
      16,
      18,
      19,
      20,
      21,
      22,
      24,
      25,
      26,
      27,
      28,
      30,
      31,
      32,
      33,
      34,
      36,
      37,
      38,
      39,
      40,
      42,
      43,
      44,
      45,
      46,
      48,
      49,
      50,
      51,
      52,
      54,
      55,
      56,
      57,
      58,
      60,
      61,
      62,
      63,
      64
    ],
    "log_scaling_alpha": 0.1,
    "log_scaling_n_floor": 128000,
    "logits_mup_width_multiplier": 24.0,
    "max_position_embeddings": 1048576,
    "mlp_layer_types": [
      "dense",
      "dense",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse",
      "sparse"
    ],
    "model_type": "inkling_text",
    "moe_intermediate_size": 3072,
    "mtp_hidden_states_first": true,
    "mtp_local_layer_ids": null,
    "n_routed_experts": 256,
    "n_shared_experts": 2,
    "norm_after_topk": true,
    "num_attention_heads": 64,
    "num_experts_per_tok": 6,
    "num_hidden_layers": 66,
    "num_key_value_heads": 8,
    "num_mtp_layers": null,
    "number_of_conv_states": 4,
    "o_bias": false,
    "pad_token_id": null,
    "q_bias": false,
    "rel_extent": 1024,
    "rms_norm_eps": 1e-06,
    "rms_norm_eps_moe_gate": 1e-06,
    "route_scale": 8.0,
    "shared_expert_sink": true,
    "sliding_window_size": 512,
    "swa_head_dim": 128,
    "swa_num_attention_heads": 64,
    "swa_num_key_value_heads": 16,
    "unpadded_vocab_size": 200058,
    "use_embed_norm": true,
    "use_gate_bias": true,
    "use_global_scale": true,
    "use_sconv": true,
    "vocab_size": 201024
  },
  "transformers_version": "5.14.1"
}
